//Напишите класс, который выводит на экран в первой строке три знака
//      «+»,во второй - четыре знака«!», в третьей - два знака«?».
public class Main
{
    public static void main(String[] args)
    {
        System.out.println("+++");
        System.out.println("!!!!");
        System.out.println("??");
    }
}